<?xml version="1.0"?>
<net name="LPRNet" version="6" batch="1">
	<layers>
		<layer name="seq_ind" type="Input" precision="FP32" id="0">
			<output>
				<port id="0">
					<dim>88</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer name="data" type="Input" precision="FP32" id="1">
			<output>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>24</dim>
					<dim>94</dim>
				</port>
			</output>
		</layer>
		<layer name="conv1" type="Convolution" precision="FP32" id="2">
			<data dilations="1,1" group="1" kernel="3,3" output="64" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>24</dim>
					<dim>94</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>94</dim>
				</port>
			</output>
			<blobs>
				<biases offset="0" size="256" />
				<weights offset="256" size="6912" />
			</blobs>
		</layer>
		<layer name="relu_conv1" type="ReLU" precision="FP32" id="3">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>94</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>94</dim>
				</port>
			</output>
		</layer>
		<layer name="pool1" type="Pooling" precision="FP32" id="4">
			<data exclude-pad="true" kernel="3,3" pads_begin="0,0" pads_end="0,0" pool-method="max" rounding_type="ceil" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>94</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>22</dim>
					<dim>92</dim>
				</port>
			</output>
		</layer>
		<layer name="fire1_small/conv_reduce" type="Convolution" precision="FP32" id="5">
			<data dilations="1,1" group="1" kernel="1,1" output="32" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>22</dim>
					<dim>92</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>22</dim>
					<dim>92</dim>
				</port>
			</output>
			<blobs>
				<biases offset="7168" size="128" />
				<weights offset="7296" size="8192" />
			</blobs>
		</layer>
		<layer name="fire1_small/relu_conv_reduce" type="ReLU" precision="FP32" id="6">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>22</dim>
					<dim>92</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>22</dim>
					<dim>92</dim>
				</port>
			</output>
		</layer>
		<layer name="fire1_small/conv_3x1" type="Convolution" precision="FP32" id="7">
			<data dilations="1,1" group="1" kernel="3,1" output="32" pads_begin="1,0" pads_end="1,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>22</dim>
					<dim>92</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>22</dim>
					<dim>92</dim>
				</port>
			</output>
			<blobs>
				<biases offset="15488" size="128" />
				<weights offset="15616" size="12288" />
			</blobs>
		</layer>
		<layer name="fire1_small/relu_conv_3x1" type="ReLU" precision="FP32" id="8">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>22</dim>
					<dim>92</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>22</dim>
					<dim>92</dim>
				</port>
			</output>
		</layer>
		<layer name="fire1_small/conv_1x3" type="Convolution" precision="FP32" id="9">
			<data dilations="1,1" group="1" kernel="1,3" output="32" pads_begin="0,1" pads_end="0,1" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>22</dim>
					<dim>92</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>22</dim>
					<dim>92</dim>
				</port>
			</output>
			<blobs>
				<biases offset="27904" size="128" />
				<weights offset="28032" size="12288" />
			</blobs>
		</layer>
		<layer name="fire1_small/relu_conv_1x3" type="ReLU" precision="FP32" id="10">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>22</dim>
					<dim>92</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>22</dim>
					<dim>92</dim>
				</port>
			</output>
		</layer>
		<layer name="fire1_small/conv_expand" type="Convolution" precision="FP32" id="11">
			<data dilations="1,1" group="1" kernel="1,1" output="128" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>22</dim>
					<dim>92</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>22</dim>
					<dim>92</dim>
				</port>
			</output>
			<blobs>
				<biases offset="40320" size="512" />
				<weights offset="40832" size="16384" />
			</blobs>
		</layer>
		<layer name="fire1_small/relu_conv_expand" type="ReLU" precision="FP32" id="12">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>22</dim>
					<dim>92</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>22</dim>
					<dim>92</dim>
				</port>
			</output>
		</layer>
		<layer name="pool2" type="Pooling" precision="FP32" id="13">
			<data exclude-pad="true" kernel="3,3" pads_begin="0,0" pads_end="0,0" pool-method="max" rounding_type="ceil" strides="2,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>22</dim>
					<dim>92</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>11</dim>
					<dim>90</dim>
				</port>
			</output>
		</layer>
		<layer name="fire2_small/conv_reduce" type="Convolution" precision="FP32" id="14">
			<data dilations="1,1" group="1" kernel="1,1" output="64" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>11</dim>
					<dim>90</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>11</dim>
					<dim>90</dim>
				</port>
			</output>
			<blobs>
				<biases offset="57216" size="256" />
				<weights offset="57472" size="32768" />
			</blobs>
		</layer>
		<layer name="fire2_small/relu_conv_reduce" type="ReLU" precision="FP32" id="15">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>11</dim>
					<dim>90</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>11</dim>
					<dim>90</dim>
				</port>
			</output>
		</layer>
		<layer name="fire2_small/conv_3x1" type="Convolution" precision="FP32" id="16">
			<data dilations="1,1" group="1" kernel="3,1" output="64" pads_begin="1,0" pads_end="1,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>11</dim>
					<dim>90</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>11</dim>
					<dim>90</dim>
				</port>
			</output>
			<blobs>
				<biases offset="90240" size="256" />
				<weights offset="90496" size="49152" />
			</blobs>
		</layer>
		<layer name="fire2_small/relu_conv_3x1" type="ReLU" precision="FP32" id="17">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>11</dim>
					<dim>90</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>11</dim>
					<dim>90</dim>
				</port>
			</output>
		</layer>
		<layer name="fire2_small/conv_1x3" type="Convolution" precision="FP32" id="18">
			<data dilations="1,1" group="1" kernel="1,3" output="64" pads_begin="0,1" pads_end="0,1" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>11</dim>
					<dim>90</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>11</dim>
					<dim>90</dim>
				</port>
			</output>
			<blobs>
				<biases offset="139648" size="256" />
				<weights offset="139904" size="49152" />
			</blobs>
		</layer>
		<layer name="fire2_small/relu_conv_1x3" type="ReLU" precision="FP32" id="19">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>11</dim>
					<dim>90</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>11</dim>
					<dim>90</dim>
				</port>
			</output>
		</layer>
		<layer name="fire2_small/conv_expand" type="Convolution" precision="FP32" id="20">
			<data dilations="1,1" group="1" kernel="1,1" output="256" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>11</dim>
					<dim>90</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>11</dim>
					<dim>90</dim>
				</port>
			</output>
			<blobs>
				<biases offset="189056" size="1024" />
				<weights offset="190080" size="65536" />
			</blobs>
		</layer>
		<layer name="fire2_small/relu_conv_expand" type="ReLU" precision="FP32" id="21">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>11</dim>
					<dim>90</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>11</dim>
					<dim>90</dim>
				</port>
			</output>
		</layer>
		<layer name="fire3_small/conv_reduce" type="Convolution" precision="FP32" id="22">
			<data dilations="1,1" group="1" kernel="1,1" output="64" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>11</dim>
					<dim>90</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>11</dim>
					<dim>90</dim>
				</port>
			</output>
			<blobs>
				<biases offset="255616" size="256" />
				<weights offset="255872" size="65536" />
			</blobs>
		</layer>
		<layer name="fire3_small/relu_conv_reduce" type="ReLU" precision="FP32" id="23">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>11</dim>
					<dim>90</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>11</dim>
					<dim>90</dim>
				</port>
			</output>
		</layer>
		<layer name="fire3_small/conv_3x1" type="Convolution" precision="FP32" id="24">
			<data dilations="1,1" group="1" kernel="3,1" output="64" pads_begin="1,0" pads_end="1,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>11</dim>
					<dim>90</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>11</dim>
					<dim>90</dim>
				</port>
			</output>
			<blobs>
				<biases offset="321408" size="256" />
				<weights offset="321664" size="49152" />
			</blobs>
		</layer>
		<layer name="fire3_small/relu_conv_3x1" type="ReLU" precision="FP32" id="25">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>11</dim>
					<dim>90</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>11</dim>
					<dim>90</dim>
				</port>
			</output>
		</layer>
		<layer name="fire3_small/conv_1x3" type="Convolution" precision="FP32" id="26">
			<data dilations="1,1" group="1" kernel="1,3" output="64" pads_begin="0,1" pads_end="0,1" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>11</dim>
					<dim>90</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>11</dim>
					<dim>90</dim>
				</port>
			</output>
			<blobs>
				<biases offset="370816" size="256" />
				<weights offset="371072" size="49152" />
			</blobs>
		</layer>
		<layer name="fire3_small/relu_conv_1x3" type="ReLU" precision="FP32" id="27">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>11</dim>
					<dim>90</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>11</dim>
					<dim>90</dim>
				</port>
			</output>
		</layer>
		<layer name="fire3_small/conv_expand" type="Convolution" precision="FP32" id="28">
			<data dilations="1,1" group="1" kernel="1,1" output="256" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>11</dim>
					<dim>90</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>11</dim>
					<dim>90</dim>
				</port>
			</output>
			<blobs>
				<biases offset="420224" size="1024" />
				<weights offset="421248" size="65536" />
			</blobs>
		</layer>
		<layer name="fire3_small/relu_conv_expand" type="ReLU" precision="FP32" id="29">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>11</dim>
					<dim>90</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>11</dim>
					<dim>90</dim>
				</port>
			</output>
		</layer>
		<layer name="pool3" type="Pooling" precision="FP32" id="30">
			<data exclude-pad="true" kernel="3,3" pads_begin="0,0" pads_end="0,0" pool-method="max" rounding_type="ceil" strides="2,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>11</dim>
					<dim>90</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>5</dim>
					<dim>88</dim>
				</port>
			</output>
		</layer>
		<layer name="conv2" type="Convolution" precision="FP32" id="31">
			<data dilations="1,1" group="1" kernel="5,1" output="128" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>5</dim>
					<dim>88</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>88</dim>
				</port>
			</output>
			<blobs>
				<biases offset="486784" size="512" />
				<weights offset="487296" size="655360" />
			</blobs>
		</layer>
		<layer name="relu_conv2" type="ReLU" precision="FP32" id="32">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>88</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>88</dim>
				</port>
			</output>
		</layer>
		<layer name="conv3_w" type="Convolution" precision="FP32" id="33">
			<data dilations="1,1" group="1" kernel="1,13" output="71" pads_begin="0,6" pads_end="0,6" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>88</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>71</dim>
					<dim>1</dim>
					<dim>88</dim>
				</port>
			</output>
			<blobs>
				<biases offset="1142656" size="284" />
				<weights offset="1142940" size="472576" />
			</blobs>
		</layer>
		<layer name="relu_conv3_w" type="ReLU" precision="FP32" id="34">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>71</dim>
					<dim>1</dim>
					<dim>88</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>71</dim>
					<dim>1</dim>
					<dim>88</dim>
				</port>
			</output>
		</layer>
		<layer name="pattern" type="FullyConnected" precision="FP32" id="35">
			<data out-size="128" quantization_level="I8" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>71</dim>
					<dim>1</dim>
					<dim>88</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
			<blobs>
				<biases offset="1615516" size="512" />
				<weights offset="1616028" size="3198976" />
			</blobs>
		</layer>
		<layer name="46/Output_0/Data__const" type="Const" precision="I32" id="36">
			<output>
				<port id="0">
					<dim>4</dim>
				</port>
			</output>
			<blobs>
				<custom offset="4815004" size="16" />
			</blobs>
		</layer>
		<layer name="reshape" type="Reshape" precision="FP32" id="37">
			<data axis="0" dim="" num_axes="-1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer name="tile" type="Tile" precision="FP32" id="38">
			<data axis="3" tiles="88" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>88</dim>
				</port>
			</output>
		</layer>
		<layer name="concat" type="Concat" precision="FP32" id="39">
			<data axis="1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>71</dim>
					<dim>1</dim>
					<dim>88</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>88</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>199</dim>
					<dim>1</dim>
					<dim>88</dim>
				</port>
			</output>
		</layer>
		<layer name="result" type="Convolution" precision="FP32" id="40">
			<data dilations="1,1" group="1" kernel="1,1" output="71" pads_begin="0,0" pads_end="0,0" quantization_level="FP32" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>199</dim>
					<dim>1</dim>
					<dim>88</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>71</dim>
					<dim>1</dim>
					<dim>88</dim>
				</port>
			</output>
			<blobs>
				<biases offset="4815020" size="284" />
				<weights offset="4815304" size="56516" />
			</blobs>
		</layer>
		<layer name="p_result" type="Permute" precision="FP32" id="41">
			<data order="3,0,1,2" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>71</dim>
					<dim>1</dim>
					<dim>88</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>88</dim>
					<dim>1</dim>
					<dim>71</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer name="45/Output_0/Data__const" type="Const" precision="I32" id="42">
			<output>
				<port id="0">
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="4871820" size="12" />
			</blobs>
		</layer>
		<layer name="reshape2" type="Reshape" precision="FP32" id="43">
			<data axis="0" dim="" num_axes="-1" />
			<input>
				<port id="0">
					<dim>88</dim>
					<dim>1</dim>
					<dim>71</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>88</dim>
					<dim>1</dim>
					<dim>71</dim>
				</port>
			</output>
		</layer>
		<layer name="decode" type="CTCGreedyDecoder" precision="FP32" id="44">
			<data ctc_merge_repeated="1" />
			<input>
				<port id="0">
					<dim>88</dim>
					<dim>1</dim>
					<dim>71</dim>
				</port>
				<port id="1">
					<dim>88</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>88</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="44" to-port="1" />
		<edge from-layer="1" from-port="0" to-layer="2" to-port="0" />
		<edge from-layer="2" from-port="1" to-layer="3" to-port="0" />
		<edge from-layer="3" from-port="1" to-layer="4" to-port="0" />
		<edge from-layer="4" from-port="1" to-layer="5" to-port="0" />
		<edge from-layer="5" from-port="1" to-layer="6" to-port="0" />
		<edge from-layer="6" from-port="1" to-layer="7" to-port="0" />
		<edge from-layer="7" from-port="1" to-layer="8" to-port="0" />
		<edge from-layer="8" from-port="1" to-layer="9" to-port="0" />
		<edge from-layer="9" from-port="1" to-layer="10" to-port="0" />
		<edge from-layer="10" from-port="1" to-layer="11" to-port="0" />
		<edge from-layer="11" from-port="1" to-layer="12" to-port="0" />
		<edge from-layer="12" from-port="1" to-layer="13" to-port="0" />
		<edge from-layer="13" from-port="1" to-layer="14" to-port="0" />
		<edge from-layer="14" from-port="1" to-layer="15" to-port="0" />
		<edge from-layer="15" from-port="1" to-layer="16" to-port="0" />
		<edge from-layer="16" from-port="1" to-layer="17" to-port="0" />
		<edge from-layer="17" from-port="1" to-layer="18" to-port="0" />
		<edge from-layer="18" from-port="1" to-layer="19" to-port="0" />
		<edge from-layer="19" from-port="1" to-layer="20" to-port="0" />
		<edge from-layer="20" from-port="1" to-layer="21" to-port="0" />
		<edge from-layer="21" from-port="1" to-layer="22" to-port="0" />
		<edge from-layer="22" from-port="1" to-layer="23" to-port="0" />
		<edge from-layer="23" from-port="1" to-layer="24" to-port="0" />
		<edge from-layer="24" from-port="1" to-layer="25" to-port="0" />
		<edge from-layer="25" from-port="1" to-layer="26" to-port="0" />
		<edge from-layer="26" from-port="1" to-layer="27" to-port="0" />
		<edge from-layer="27" from-port="1" to-layer="28" to-port="0" />
		<edge from-layer="28" from-port="1" to-layer="29" to-port="0" />
		<edge from-layer="29" from-port="1" to-layer="30" to-port="0" />
		<edge from-layer="30" from-port="1" to-layer="31" to-port="0" />
		<edge from-layer="31" from-port="1" to-layer="32" to-port="0" />
		<edge from-layer="32" from-port="1" to-layer="33" to-port="0" />
		<edge from-layer="33" from-port="1" to-layer="34" to-port="0" />
		<edge from-layer="34" from-port="1" to-layer="39" to-port="0" />
		<edge from-layer="34" from-port="1" to-layer="35" to-port="0" />
		<edge from-layer="35" from-port="1" to-layer="37" to-port="0" />
		<edge from-layer="36" from-port="0" to-layer="37" to-port="1" />
		<edge from-layer="37" from-port="2" to-layer="38" to-port="0" />
		<edge from-layer="38" from-port="1" to-layer="39" to-port="1" />
		<edge from-layer="39" from-port="2" to-layer="40" to-port="0" />
		<edge from-layer="40" from-port="1" to-layer="41" to-port="0" />
		<edge from-layer="41" from-port="1" to-layer="43" to-port="0" />
		<edge from-layer="42" from-port="0" to-layer="43" to-port="1" />
		<edge from-layer="43" from-port="2" to-layer="44" to-port="0" />
	</edges>
	<statistics>
		<layer>
			<name>concat</name>
			<min>-0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -2.164291, -2.322438, -2.939935, -1.880298, -2.417380, -1.536467, -1.459999, -2.091069, -4.624750, -1.992275, -1.929561, -3.820985, -1.676997, -2.494765, -2.496740, -1.189873, -1.554134, -1.758603, -1.806948, -3.155364, -1.692444, -1.731497, -2.087521, -0.903761, -4.814262, -2.058711, -1.658811, -2.247234, -2.806656, -1.768720, -1.768732, -2.438481, -2.586417, -2.316912, -1.959421, -2.251451, -1.997761, -2.420890, -2.244236, -2.986979, -3.863318, -1.554082, -2.010072, -4.355974, -2.457117, -1.936087, -1.515437, -3.074288, -7.644201, -2.739891, -2.301255, -2.064566, -1.708771, -3.269259, -3.865408, -8.558304, -4.668336, -2.643782, -11.622900, -2.387968, -2.202042, -7.701473, -2.077775, -1.723505, -1.885810, -1.699111, -2.653985, -2.157284, -2.337085, -2.774206, -2.370868, -1.757855, -2.009685, -1.337209, -1.935844, -1.504950, -1.733539, -2.659920, -1.419544, -18.437536, -1.432814, -2.158587, -2.523098, -2.611004, -1.978830, -6.043081, -2.168104, -1.905280, -3.036022, -5.520495, -2.285987, -2.484413, -2.462305, -2.655342, -2.288046, -2.955806, -2.755509, -2.646471, -2.250329, -1.944195, -6.513594, -2.427064, -1.978135, -1.549885, -2.173381, -1.963493, -5.631084, -1.861407, -2.362957, -3.530821, -2.755742, -2.661187, -2.112477, -1.919436, -1.727550, -2.313748, -3.503918, -1.953473, -3.347196, -4.033703, -2.359569, -1.810475, -20.136536, -5.273794, -1.790526, -2.893194, -3.898597, -2.527322</min>
			<max>0.855657, 0.766961, 0.756185, 1.528155, 0.854354, 0.932086, 1.029030, 0.575236, 0.972730, 0.470022, 0.379686, 0.723382, 0.347712, 0.441611, 0.677222, 0.689676, 0.769033, 1.021330, 0.649142, 0.754034, 0.537246, 0.378477, 0.712899, 0.773065, 0.841390, 0.588859, 0.773883, 0.429433, 0.660656, 0.401921, 0.964962, 0.725484, 0.534352, 0.685903, 0.733133, 0.675480, 1.235986, 0.778130, 0.387331, 0.671349, 0.535089, 0.775442, 0.435745, 0.503931, 0.421145, 0.905714, 0.583734, 0.525443, 0.602540, 0.687023, 1.359369, 0.713756, 0.599450, 0.592625, 0.886287, 0.611502, 1.379877, 0.680164, 0.580513, 0.549156, 0.542006, 0.963146, 0.236212, 0.820801, 0.640409, 0.538405, 0.768144, 3.681136, 0.726153, 0.478617, 0.828447, 1.973957, 1.907075, 2.470774, 2.346050, 1.892179, 2.103940, 3.101889, 2.391822, 3.324807, 2.360310, 2.458409, 4.720315, 2.307455, 1.543017, 2.050123, 2.759767, 2.662726, 1.966998, 1.906292, 2.513080, 2.530412, 2.442268, 1.837290, 3.522989, 5.618392, 2.295695, 2.598321, 1.547830, 2.126009, 1.827938, 2.743852, 2.620197, 1.629652, 2.451391, 2.286746, 1.569831, 2.278537, 1.776305, 6.767633, 1.448632, 6.049217, 3.108225, 1.952767, 6.646216, 1.657884, 2.668585, 2.876164, 2.114922, 4.184802, 4.715750, 1.940477, 1.873191, 2.736711, 6.391356, 6.182351, 6.368523, 8.304164, 1.222004, 8.899870, 2.057858, 1.910267, 5.590934, 2.054396, 2.424060, 3.924848, 2.428838, 1.931470, 2.041834, 2.542528, 1.652045, 1.896322, 2.149406, 2.477596, 2.424298, 2.445069, 3.096138, 1.909275, 1.550933, 2.945718, -0.450515, 3.219730, 1.930188, 2.833231, 2.317399, 2.660112, 4.811356, 2.253391, 2.464487, 1.284108, 8.389408, 1.979117, 1.387664, 2.317030, 4.406434, 2.364188, 1.832222, 2.206244, 2.248951, 2.487833, 1.826148, 5.159889, 2.239402, 2.390488, 3.544082, 1.907790, 1.864492, 15.966466, 2.944020, 1.559697, 1.497924, 1.860446, 2.175959, 3.075139, 3.067989, 2.794094, 1.794835, 2.717713, 2.500749, 2.590245, 3.123442, 3.371797, 4.250096, -10.653842, 7.218647, 2.710034, 2.083210, 6.386056, 1.341905</max>
		</layer>
		<layer>
			<name>conv1</name>
			<min>-3.652211, -4.548208, -6.246492, -0.674041, -4.201730, -3.178394, -9.222250, -7.565010, -7.533330, -4.573831, -11.266838, -5.171038, -4.363829, -4.205803, -5.431664, -7.665269, -3.403890, -6.970990, -1.087797, -4.141762, -4.745019, -5.196712, -6.860384, -5.020693, -6.507735, -6.633042, -5.447368, -6.679873, -9.753852, -5.246470, -4.564614, -8.415320, -7.988101, -3.947904, -13.388194, -7.062674, -3.667696, -10.101929, -1.689963, -6.211902, -6.871017, -2.387368, -8.263245, -6.579071, -2.380524, -5.247977, -6.926018, -4.502759, -5.855952, -5.264684, -3.226827, -5.203685, -7.684686, -4.690296, -3.421248, -13.622366, -3.043355, -5.212318, -4.053997, -5.623225, -5.979179, -10.113017, -7.533273, -4.853895</min>
			<max>5.140550, 6.906327, 5.276833, 0.957184, 5.733043, 5.586656, 8.175941, 6.286814, 8.848027, 6.496203, 7.498220, 4.525346, 2.485764, 4.095982, 4.914837, 8.924070, 3.778291, 6.060886, 3.215401, 2.488796, 5.393886, 5.549800, 6.997329, 5.838160, 4.913776, 10.716143, 4.362957, 5.940252, 12.772952, 7.220349, 3.261480, 10.059635, 6.651850, 2.950872, 11.091149, 6.742132, 3.650035, 8.587179, 2.763879, 4.277616, 11.581767, 2.239597, 5.699358, 5.432875, 1.784608, 5.386084, 4.380629, 6.994524, 4.748490, 3.422478, 6.135737, 2.664987, 6.745206, 2.574700, 6.564127, 8.968923, 2.608935, 8.266464, 5.904207, 9.063972, 6.550776, 7.109301, 7.309756, 8.931138</max>
		</layer>
		<layer>
			<name>conv2</name>
			<min>-12.625163, -4.397133, -2.644384, -3.536643, -3.610177, -4.317132, -1.814772, -2.191210, -3.564846, -4.548091, -2.824122, -3.603167, -3.828651, -6.060819, -4.051392, -10.756386, -3.186324, -8.798984, -6.357087, -3.502939, -3.434788, -2.467868, -3.826053, -3.800148, -2.708801, -10.197258, -2.388405, -3.248887, -2.869420, -3.480084, -4.541144, -3.159165, -3.565403, -5.559679, -4.060614, -4.024678, -3.747468, -2.486664, -2.603419, -3.922917, -4.892223, -6.578934, -3.265746, -3.037079, -4.600082, -2.606399, -4.368220, -3.795290, -3.916808, -10.361959, -2.483294, -2.681149, -2.795427, -4.433588, -3.180119, -2.721705, -3.156181, -10.386389, -3.183624, -3.161450, -3.695925, -3.549292, -2.997777, -1.828199, -2.997329, -2.251240, -10.142984, -2.953757, -4.333797, -4.540922, -2.626155, -3.198854, -2.532357, -4.169703, -4.333729, -4.563631, -2.699570, -3.173879, -3.239587, -2.501007, -2.487085, -3.583621, -2.642604, -3.320978, -3.110852, -2.423140, -4.577065, -3.136633, -3.256460, -4.320828, -2.983049, -2.682910, -4.203756, -2.822155, -6.007296, -3.492530, -5.144628, -13.619384, -3.263891, -11.636833, -2.617508, -4.214141, -2.083701, -3.004108, -3.128106, -2.739423, -6.097960, -2.345933, -2.507178, -4.041502, -3.538296, -14.197898, -2.750872, -3.476966, -3.294336, -3.194663, -2.307699, -2.607262, -2.903996, -3.482782, -3.972641, -14.224760, -6.116092, -5.258983, -2.638149, -5.534846, -4.184958, -1.530979</min>
			<max>3.533627, 1.520428, 1.768446, 1.684833, 2.749979, 5.308498, 2.331140, 5.487236, 1.511603, 1.964843, 1.915642, 1.491107, 2.992757, 1.487663, 1.747823, 3.148400, 1.861138, 2.924449, 1.432566, 1.571818, 2.184232, 1.661875, 1.730553, 2.604240, 1.946372, 3.301068, 2.609871, 1.417261, 1.880880, 1.578312, 2.446555, 1.791360, 2.557209, 1.480841, 2.283664, 2.067613, 1.490511, 1.779125, 3.012902, 1.368701, 1.604701, 9.146325, 8.803477, 2.144420, 1.577367, 1.565277, 1.509905, 5.703854, 2.934924, 3.214124, 1.591299, 1.505508, 1.578963, 1.591018, 1.669776, 7.689878, 1.579863, 2.693196, 1.441832, 4.359479, 1.641667, 1.514618, 3.306618, 1.604477, 3.616065, 5.487117, 2.756708, 1.192938, 2.990500, 1.935500, 1.695459, 1.210394, 1.790378, 1.757311, 1.640046, 1.583319, 2.043930, 1.999080, 7.384157, 2.250841, 3.200345, 2.963149, 1.516876, 2.527644, 3.839601, 1.661404, 4.726214, 3.388816, 2.452142, 3.777561, 1.612624, 1.513057, 2.660988, 3.594336, 10.441744, 1.867687, 1.491485, 3.439333, 1.956531, 3.654541, 2.734940, 1.937137, 1.368843, 1.654726, 2.078568, 1.568052, 1.464157, 1.841969, 3.584718, 2.201912, 1.831437, 3.377659, 1.950618, 2.077560, 1.864217, 3.569675, 1.858977, 1.970013, 1.421211, 2.099186, 1.627410, 3.537914, 2.125099, 1.458453, 1.499002, 1.566328, 1.646909, 1.916839</max>
		</layer>
		<layer>
			<name>conv3_w</name>
			<min>-2.610410, -2.539079, -2.176002, -4.366225, -2.153633, -3.085949, -2.602642, -2.690834, -2.923965, -1.803887, -1.722136, -3.746963, -2.265942, -1.742073, -1.795316, -2.624487, -2.570489, -3.579123, -1.905891, -2.231790, -2.193716, -1.855543, -1.966393, -3.186161, -3.123211, -2.194326, -2.815256, -1.726802, -2.278020, -2.663595, -2.372253, -2.970102, -2.624565, -2.589366, -2.403109, -2.164968, -6.094959, -3.276904, -2.471735, -1.975185, -1.958759, -3.046803, -2.147145, -2.274278, -2.322788, -2.763168, -2.103460, -2.189024, -2.800221, -1.527026, -6.329981, -2.187310, -2.155801, -1.808452, -3.941106, -4.196928, -11.651917, -1.942143, -1.945408, -2.116163, -2.136530, -2.955095, -2.968946, -2.479366, -2.031240, -2.298448, -1.762113, -8.266047, -2.505241, -2.382692, -4.773044</min>
			<max>0.855657, 0.766961, 0.756185, 1.528155, 0.854354, 0.932086, 1.029030, 0.575236, 0.972730, 0.470022, 0.379686, 0.723382, 0.347712, 0.441611, 0.677222, 0.689676, 0.769033, 1.021330, 0.649142, 0.754034, 0.537246, 0.378477, 0.712899, 0.773065, 0.841390, 0.588859, 0.773883, 0.429433, 0.660656, 0.401921, 0.964962, 0.725484, 0.534352, 0.685903, 0.733133, 0.675480, 1.235986, 0.778130, 0.387331, 0.671349, 0.535089, 0.775442, 0.435745, 0.503931, 0.421145, 0.905714, 0.583734, 0.525443, 0.602540, 0.687023, 1.359369, 0.713756, 0.599450, 0.592625, 0.886287, 0.611502, 1.379877, 0.680164, 0.580513, 0.549156, 0.542006, 0.963146, 0.236212, 0.820801, 0.640409, 0.538405, 0.768144, 3.681136, 0.726153, 0.478617, 0.828447</max>
		</layer>
		<layer>
			<name>data</name>
			<min>0.000000, 0.000000, 0.000000</min>
			<max>255.000000, 255.000000, 255.000000</max>
		</layer>
		<layer>
			<name>decode</name>
			<min>11.000000, 40.000000, 0.000000, 0.000000, 0.000000, 0.000000, 0.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000</min>
			<max>66.000000, 59.000000, 69.000000, 60.000000, 9.000000, 9.000000, 45.000000, 67.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000, -1.000000</max>
		</layer>
		<layer>
			<name>fire1_small/conv_1x3</name>
			<min>-5.055039, -3.508068, -5.024673, -5.966712, -3.220649, -5.836535, -4.952312, -5.277858, -4.363898, -3.865590, -4.249295, -7.613588, -2.905670, -4.353676, -3.259186, -2.338042, -4.734015, -3.646690, -3.356125, -2.853191, -2.996210, -5.605073, -6.674377, -5.374749, -2.482357, -4.587175, -5.820848, -9.318307, -7.691108, -6.197828, -5.625298, -7.666148</min>
			<max>7.777027, 8.162677, 7.060055, 7.303615, 8.642486, 4.170534, 5.434154, 6.980188, 6.478811, 6.880371, 6.879227, 5.476527, 6.104692, 4.168400, 5.329570, 7.141295, 5.521320, 6.685498, 8.640151, 9.072343, 6.312901, 8.867346, 6.064400, 5.218592, 4.868745, 10.769049, 4.324142, 9.489583, 7.821389, 7.188974, 7.857893, 8.426749</max>
		</layer>
		<layer>
			<name>fire1_small/conv_3x1</name>
			<min>-3.333439, -7.913307, -3.052812, -1.249296, -5.675426, -6.869944, -5.166490, -7.734864, -4.511203, -5.449320, -6.508387, -4.555776, -4.673973, -4.560652, -4.230158, -4.224895, -6.800643, -6.575636, -5.051768, -4.753503, -2.431759, -3.545564, -3.626272, -9.204302, -1.503265, -5.040336, -8.208397, -3.999795, -1.859379, -8.059474, -9.017466, -6.219090</min>
			<max>7.148094, 7.140897, 6.020904, 5.786381, 6.150854, 5.782705, 6.778213, 7.715986, 8.884480, 3.735133, 3.651113, 4.541886, 6.745571, 6.720175, 3.567747, 4.628753, 5.559233, 6.502028, 4.154635, 2.379085, 9.533865, 8.295405, 7.062616, 4.419368, 9.019661, 5.161271, 4.890641, 4.972346, 7.595318, 6.283554, 6.132178, 3.902367</max>
		</layer>
		<layer>
			<name>fire1_small/conv_expand</name>
			<min>-4.896079, -4.784245, -5.916213, -7.527268, -3.316700, -8.371759, -6.806331, -6.007727, -3.934610, -8.718225, -7.036486, -7.385936, -8.788637, -11.573197, -3.694494, -6.171977, -7.474049, -4.687068, -3.966754, -4.742432, -7.898961, -9.723939, -6.975043, -7.816143, -9.827128, -6.103061, -6.780532, -5.939999, -6.861675, -3.186526, -4.616850, -5.560456, -5.630196, -5.885654, -3.359170, -8.136770, -6.754639, -4.792486, -6.524352, -12.254346, -4.885145, -8.295588, -5.197331, -7.068199, -6.327199, -7.050424, -6.513071, -4.496998, -5.764050, -9.239811, -5.352386, -10.764050, -4.767476, -4.079494, -3.703989, -7.613097, -5.886881, -6.645448, -5.903452, -7.237859, -6.908112, -5.707591, -3.684694, -5.960332, -9.451729, -2.561758, -4.864853, -4.990160, -6.369092, -6.605582, -6.956455, -5.137952, -3.572292, -5.048713, -5.455292, -4.849333, -6.125247, -4.973607, -6.971373, -7.136157, -5.458054, -5.959716, -12.933469, -5.735901, -8.066298, -5.064433, -4.471025, -5.689811, -8.200331, -7.117918, -4.659371, -6.073699, -6.646410, -6.292872, -4.695152, -7.854989, -5.585408, -4.492588, -5.284015, -6.733053, -2.557827, -3.715759, -7.135974, -6.210174, -7.671911, -4.497914, -7.191747, -6.157603, -12.977872, -4.871956, -5.748306, -6.054866, -6.267351, -4.868507, -3.440928, -5.972675, -6.625786, -6.134800, -5.511081, -6.861535, -5.245563, -8.274103, -6.368184, -5.144597, -6.099011, -6.245657, -12.606855, -8.511548</min>
			<max>6.336308, 4.642532, 6.595642, 3.742797, 8.091406, 3.726863, 8.149952, 6.022142, 8.188844, 4.183142, 9.789543, 5.828625, 5.355117, 5.698557, 7.300335, 6.562860, 6.091546, 6.218506, 6.151478, 6.845715, 6.322960, 5.518674, 7.917527, 7.868219, 6.788667, 7.574995, 5.255313, 3.965923, 9.295394, 6.133234, 6.486980, 6.450157, 6.895561, 5.887733, 8.014068, 7.403666, 5.561379, 4.578154, 5.257075, 5.488817, 8.221608, 5.206055, 5.253898, 5.070620, 6.390105, 6.161047, 7.295952, 6.707243, 8.371967, 7.367469, 7.471734, 4.132164, 7.009287, 6.839469, 7.585324, 6.392080, 5.786315, 3.880344, 5.917636, 5.338875, 5.351772, 7.043650, 5.443910, 2.784368, 6.803580, 6.036033, 8.726698, 7.163081, 7.201141, 7.402784, 7.316999, 6.535029, 4.283328, 7.203880, 5.490251, 5.714152, 7.183372, 8.526775, 4.182202, 3.946326, 7.667301, 7.528315, 4.663139, 6.468657, 9.493517, 4.476044, 7.002403, 4.463255, 4.089437, 4.376685, 4.685530, 6.911233, 5.004527, 7.305326, 7.341395, 5.237681, 8.788555, 5.295693, 4.963021, 5.459127, 5.339744, 5.239004, 5.300593, 6.064887, 4.897575, 5.414970, 7.779529, 3.785195, 6.519820, 4.892653, 5.458430, 3.648134, 4.091211, 6.060548, 4.460238, 5.489353, 8.241743, 6.477386, 4.405165, 4.291198, 6.933552, 7.288836, 6.492459, 4.643635, 5.705637, 5.386655, 8.924078, 3.875231</max>
		</layer>
		<layer>
			<name>fire1_small/conv_reduce</name>
			<min>-7.314811, -4.230185, -6.638330, -2.375868, -3.691938, -8.523698, -9.797098, -8.942577, -4.669613, -6.344053, -3.840367, -1.276681, -7.706227, -1.522506, -0.163659, -8.063564, -9.496776, -1.735773, -7.558903, -7.936291, -6.392689, -8.748434, -10.905034, -8.345824, -9.071362, -3.918844, -7.050201, -8.385531, -6.132803, -4.168841, -9.292191, -7.913477</min>
			<max>4.052445, 4.654587, 3.555505, 3.702484, 6.164340, 5.293082, 5.073029, 4.538810, 4.053486, 5.072926, 5.929383, 5.416520, 2.478841, 9.213718, 8.415408, 4.979585, 1.732444, 6.611269, 7.519622, 6.926536, 4.271527, 5.290087, 6.553559, 2.690378, 5.147738, 9.004613, 4.155654, 3.884512, 5.223478, 3.565349, 4.000217, 6.768880</max>
		</layer>
		<layer>
			<name>fire1_small/relu_conv_1x3</name>
			<min>-0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000</min>
			<max>7.777027, 8.162677, 7.060055, 7.303615, 8.642486, 4.170534, 5.434154, 6.980188, 6.478811, 6.880371, 6.879227, 5.476527, 6.104692, 4.168400, 5.329570, 7.141295, 5.521320, 6.685498, 8.640151, 9.072343, 6.312901, 8.867346, 6.064400, 5.218592, 4.868745, 10.769049, 4.324142, 9.489583, 7.821389, 7.188974, 7.857893, 8.426749</max>
		</layer>
		<layer>
			<name>fire1_small/relu_conv_3x1</name>
			<min>-0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000</min>
			<max>7.148094, 7.140897, 6.020904, 5.786381, 6.150854, 5.782705, 6.778213, 7.715986, 8.884480, 3.735133, 3.651113, 4.541886, 6.745571, 6.720175, 3.567747, 4.628753, 5.559233, 6.502028, 4.154635, 2.379085, 9.533865, 8.295405, 7.062616, 4.419368, 9.019661, 5.161271, 4.890641, 4.972346, 7.595318, 6.283554, 6.132178, 3.902367</max>
		</layer>
		<layer>
			<name>fire1_small/relu_conv_expand</name>
			<min>-0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000</min>
			<max>6.336308, 4.642532, 6.595642, 3.742797, 8.091406, 3.726863, 8.149952, 6.022142, 8.188844, 4.183142, 9.789543, 5.828625, 5.355117, 5.698557, 7.300335, 6.562860, 6.091546, 6.218506, 6.151478, 6.845715, 6.322960, 5.518674, 7.917527, 7.868219, 6.788667, 7.574995, 5.255313, 3.965923, 9.295394, 6.133234, 6.486980, 6.450157, 6.895561, 5.887733, 8.014068, 7.403666, 5.561379, 4.578154, 5.257075, 5.488817, 8.221608, 5.206055, 5.253898, 5.070620, 6.390105, 6.161047, 7.295952, 6.707243, 8.371967, 7.367469, 7.471734, 4.132164, 7.009287, 6.839469, 7.585324, 6.392080, 5.786315, 3.880344, 5.917636, 5.338875, 5.351772, 7.043650, 5.443910, 2.784368, 6.803580, 6.036033, 8.726698, 7.163081, 7.201141, 7.402784, 7.316999, 6.535029, 4.283328, 7.203880, 5.490251, 5.714152, 7.183372, 8.526775, 4.182202, 3.946326, 7.667301, 7.528315, 4.663139, 6.468657, 9.493517, 4.476044, 7.002403, 4.463255, 4.089437, 4.376685, 4.685530, 6.911233, 5.004527, 7.305326, 7.341395, 5.237681, 8.788555, 5.295693, 4.963021, 5.459127, 5.339744, 5.239004, 5.300593, 6.064887, 4.897575, 5.414970, 7.779529, 3.785195, 6.519820, 4.892653, 5.458430, 3.648134, 4.091211, 6.060548, 4.460238, 5.489353, 8.241743, 6.477386, 4.405165, 4.291198, 6.933552, 7.288836, 6.492459, 4.643635, 5.705637, 5.386655, 8.924078, 3.875231</max>
		</layer>
		<layer>
			<name>fire1_small/relu_conv_reduce</name>
			<min>-0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000</min>
			<max>4.052445, 4.654587, 3.555505, 3.702484, 6.164340, 5.293082, 5.073029, 4.538810, 4.053486, 5.072926, 5.929383, 5.416520, 2.478841, 9.213718, 8.415408, 4.979585, 1.732444, 6.611269, 7.519622, 6.926536, 4.271527, 5.290087, 6.553559, 2.690378, 5.147738, 9.004613, 4.155654, 3.884512, 5.223478, 3.565349, 4.000217, 6.768880</max>
		</layer>
		<layer>
			<name>fire2_small/conv_1x3</name>
			<min>-5.662002, -5.676568, -6.158097, -4.506341, -4.845433, -4.324377, -5.155601, -6.273253, -4.009207, -4.479293, -6.006046, -5.569757, -5.349643, -4.475398, -5.915718, -3.675591, -5.139047, -6.643983, -5.841126, -5.551879, -6.649689, -5.146991, -5.376944, -6.105054, -4.315125, -4.391626, -4.792040, -5.687278, -5.618778, -5.149968, -5.184719, -3.969377, -4.500350, -4.757916, -2.934583, -7.878256, -5.084547, -4.812435, -4.511007, -5.194366, -4.860472, -6.419716, -4.406530, -4.186063, -5.422177, -4.900561, -5.947144, -4.921841, -6.605070, -5.691771, -5.050965, -6.088966, -4.852669, -6.275869, -5.569353, -4.812712, -5.302036, -5.136350, -5.364039, -6.830221, -5.433231, -5.049799, -5.291489, -5.744180</min>
			<max>7.543250, 5.685919, 5.571259, 6.159765, 4.946389, 5.994325, 5.979223, 5.221121, 5.421602, 4.830872, 4.970909, 6.824202, 4.754390, 4.378588, 5.899417, 6.984755, 6.424849, 3.989743, 5.844888, 5.204987, 5.515413, 5.654727, 5.666178, 5.941490, 6.009606, 4.572641, 5.144457, 4.970737, 7.469104, 5.685948, 4.991958, 5.938211, 4.179103, 4.385413, 4.467889, 6.069292, 6.256787, 3.839530, 4.951977, 5.706465, 5.560437, 6.201326, 5.544044, 6.601505, 5.448153, 5.595945, 6.328124, 6.757728, 5.024930, 4.989180, 4.523674, 4.613168, 5.627579, 5.282365, 6.987792, 4.983933, 5.956266, 6.186394, 5.410151, 4.709256, 5.730506, 4.333102, 5.391086, 6.527787</max>
		</layer>
		<layer>
			<name>fire2_small/conv_3x1</name>
			<min>-4.932095, -6.657721, -5.798114, -6.322212, -6.015411, -3.749066, -5.753113, -5.134863, -5.197032, -7.154025, -6.889036, -6.384786, -4.998718, -5.360829, -4.004467, -5.276424, -5.883854, -6.534321, -6.349007, -6.719009, -7.428867, -6.866589, -3.420825, -6.404718, -3.042114, -5.347092, -6.023545, -5.509349, -2.360013, -6.047067, -6.596389, -5.181498, -4.414567, -4.124516, -5.186379, -5.202356, -4.276637, -4.714232, -5.519405, -4.372355, -5.339107, -7.538147, -6.885551, -5.850635, -5.681382, -3.291820, -5.624345, -6.643957, -3.869439, -4.853380, -4.810822, -5.103640, -2.615209, -3.407078, -5.860645, -4.242049, -8.333838, -4.682615, -4.503227, -3.129168, -3.168288, -4.812769, -5.395082, -6.248891</min>
			<max>4.973233, 6.596076, 5.251996, 5.365886, 5.646044, 6.911343, 5.717467, 5.676366, 4.451376, 6.859503, 4.082691, 7.589256, 4.064390, 3.868915, 5.991147, 6.490387, 3.837931, 4.475589, 6.617901, 5.246351, 6.220881, 6.962050, 6.162057, 4.212463, 5.654096, 7.971489, 4.199929, 5.102161, 5.298774, 6.220940, 4.832434, 7.023307, 4.928368, 4.016806, 5.691723, 6.734140, 5.292363, 4.941484, 4.894709, 6.652419, 6.798979, 4.924473, 5.386014, 5.285189, 5.499180, 6.396723, 6.662220, 3.814257, 6.031660, 4.580714, 3.345694, 5.167852, 8.806727, 5.407187, 5.637810, 3.989860, 5.504767, 5.665143, 3.062729, 4.679807, 4.772268, 6.245214, 5.884959, 4.326928</max>
		</layer>
		<layer>
			<name>fire2_small/conv_expand</name>
