<?xml version="1.0"?>
<net name="vehicle-license-plate-detection-barrier-0106" version="6" batch="1">
	<layers>
		<layer name="SSD/concat_reshape_softmax/mbox_loc_final/shape/Output_0/Data__const" type="Const" precision="I32" id="0">
			<output>
				<port id="0">
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="0" size="12" />
			</blobs>
		</layer>
		<layer name="SSD/concat_reshape_softmax/mbox_conf_logits/shape/Output_0/Data__const" type="Const" precision="I32" id="1">
			<output>
				<port id="0">
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="12" size="12" />
			</blobs>
		</layer>
		<layer name="SSD/concat_reshape_softmax/concat/Output_0/Data__const" type="Const" precision="I32" id="2">
			<output>
				<port id="0">
					<dim>2</dim>
				</port>
			</output>
			<blobs>
				<custom offset="24" size="8" />
			</blobs>
		</layer>
		<layer name="SSD/concat_reshape_softmax/Shape/Output_0/Data__const" type="Const" precision="I32" id="3">
			<output>
				<port id="0">
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="32" size="12" />
			</blobs>
		</layer>
		<layer name="Placeholder" type="Input" precision="FP32" id="4">
			<output>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</output>
		</layer>
		<layer name="Mul_/Fused_Mul_/FusedScaleShift_" type="ScaleShift" precision="FP32" id="5">
			<data broadcast="0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>3</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</output>
			<blobs>
				<biases offset="44" size="12" />
				<weights offset="56" size="12" />
			</blobs>
		</layer>
		<layer name="MobilenetV2/Conv/Conv2D" type="Convolution" precision="FP32" id="6">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" output="16" pads_begin="0,0" pads_end="1,1" quantization_level="FP32" strides="2,2" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</output>
			<blobs>
				<biases offset="68" size="64" />
				<weights offset="132" size="1728" />
			</blobs>
		</layer>
		<layer name="MobilenetV2/Conv/Relu6" type="Clamp" precision="FP32" id="7">
			<data max="6.000000" min="0.000000" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</output>
		</layer>
		<layer name="MobilenetV2/expanded_conv/depthwise/depthwise" type="Convolution" precision="FP32" id="8">
			<data auto_pad="same_upper" dilations="1,1" group="16" kernel="3,3" output="16" pads_begin="1,1" pads_end="1,1" quantization_level="FP32" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</output>
			<blobs>
				<biases offset="1860" size="64" />
				<weights offset="1924" size="576" />
			</blobs>
		</layer>
		<layer name="MobilenetV2/expanded_conv/depthwise/Relu6" type="Clamp" precision="FP32" id="9">
			<data max="6.000000" min="0.000000" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</output>
		</layer>
		<layer name="MobilenetV2/expanded_conv/project/Conv2D" type="Convolution" precision="FP32" id="10">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="16" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</output>
			<blobs>
				<biases offset="2500" size="64" />
				<weights offset="2564" size="1024" />
			</blobs>
		</layer>
		<layer name="MobilenetV2/expanded_conv/add" type="Eltwise" precision="FP32" id="11">
			<data operation="sum" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>16</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</output>
		</layer>
		<layer name="MobilenetV2/expanded_conv_1/expand/Conv2D" type="Convolution" precision="FP32" id="12">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="96" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</output>
			<blobs>
				<biases offset="3588" size="384" />
				<weights offset="3972" size="6144" />
			</blobs>
		</layer>
		<layer name="MobilenetV2/expanded_conv_1/expand/Relu6" type="Clamp" precision="FP32" id="13">
			<data max="6.000000" min="0.000000" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</output>
		</layer>
		<layer name="MobilenetV2/expanded_conv_1/depthwise/depthwise" type="Convolution" precision="FP32" id="14">
			<data auto_pad="same_upper" dilations="1,1" group="96" kernel="3,3" output="96" pads_begin="0,0" pads_end="1,1" quantization_level="I8" strides="2,2" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</output>
			<blobs>
				<biases offset="10116" size="384" />
				<weights offset="10500" size="3456" />
			</blobs>
		</layer>
		<layer name="MobilenetV2/expanded_conv_1/depthwise/Relu6" type="Clamp" precision="FP32" id="15">
			<data max="6.000000" min="0.000000" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</output>
		</layer>
		<layer name="MobilenetV2/expanded_conv_1/project/Conv2D" type="Convolution" precision="FP32" id="16">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="16" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</output>
			<blobs>
				<biases offset="13956" size="64" />
				<weights offset="14020" size="6144" />
			</blobs>
		</layer>
		<layer name="MobilenetV2/expanded_conv_2/expand/Conv2D" type="Convolution" precision="FP32" id="17">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="96" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</output>
			<blobs>
				<biases offset="20164" size="384" />
				<weights offset="20548" size="6144" />
			</blobs>
		</layer>
		<layer name="MobilenetV2/expanded_conv_2/expand/Relu6" type="Clamp" precision="FP32" id="18">
			<data max="6.000000" min="0.000000" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</output>
		</layer>
		<layer name="MobilenetV2/expanded_conv_2/depthwise/depthwise" type="Convolution" precision="FP32" id="19">
			<data auto_pad="same_upper" dilations="1,1" group="96" kernel="3,3" output="96" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</output>
			<blobs>
				<biases offset="26692" size="384" />
				<weights offset="27076" size="3456" />
			</blobs>
		</layer>
		<layer name="MobilenetV2/expanded_conv_2/depthwise/Relu6" type="Clamp" precision="FP32" id="20">
			<data max="6.000000" min="0.000000" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</output>
		</layer>
		<layer name="MobilenetV2/expanded_conv_2/project/Conv2D" type="Convolution" precision="FP32" id="21">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="16" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</output>
			<blobs>
				<biases offset="30532" size="64" />
				<weights offset="30596" size="6144" />
			</blobs>
		</layer>
		<layer name="MobilenetV2/expanded_conv_2/add" type="Eltwise" precision="FP32" id="22">
			<data operation="sum" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>16</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</output>
		</layer>
		<layer name="MobilenetV2/expanded_conv_3/expand/Conv2D" type="Convolution" precision="FP32" id="23">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="96" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</output>
			<blobs>
				<biases offset="36740" size="384" />
				<weights offset="37124" size="6144" />
			</blobs>
		</layer>
		<layer name="MobilenetV2/expanded_conv_3/expand/Relu6" type="Clamp" precision="FP32" id="24">
			<data max="6.000000" min="0.000000" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</output>
		</layer>
		<layer name="MobilenetV2/expanded_conv_3/depthwise/depthwise" type="Convolution" precision="FP32" id="25">
			<data auto_pad="same_upper" dilations="1,1" group="96" kernel="3,3" output="96" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="2,2" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</output>
			<blobs>
				<biases offset="43268" size="384" />
				<weights offset="43652" size="3456" />
			</blobs>
		</layer>
		<layer name="MobilenetV2/expanded_conv_3/depthwise/Relu6" type="Clamp" precision="FP32" id="26">
			<data max="6.000000" min="0.000000" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</output>
		</layer>
		<layer name="MobilenetV2/expanded_conv_3/project/Conv2D" type="Convolution" precision="FP32" id="27">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="16" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</output>
			<blobs>
				<biases offset="47108" size="64" />
				<weights offset="47172" size="6144" />
			</blobs>
		</layer>
		<layer name="MobilenetV2/expanded_conv_4/expand/Conv2D" type="Convolution" precision="FP32" id="28">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="96" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</output>
			<blobs>
				<biases offset="53316" size="384" />
				<weights offset="53700" size="6144" />
			</blobs>
		</layer>
		<layer name="MobilenetV2/expanded_conv_4/expand/Relu6" type="Clamp" precision="FP32" id="29">
			<data max="6.000000" min="0.000000" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</output>
		</layer>
		<layer name="MobilenetV2/expanded_conv_4/depthwise/depthwise" type="Convolution" precision="FP32" id="30">
			<data auto_pad="same_upper" dilations="1,1" group="96" kernel="3,3" output="96" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</output>
			<blobs>
				<biases offset="59844" size="384" />
				<weights offset="60228" size="3456" />
			</blobs>
		</layer>
		<layer name="MobilenetV2/expanded_conv_4/depthwise/Relu6" type="Clamp" precision="FP32" id="31">
			<data max="6.000000" min="0.000000" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</output>
		</layer>
		<layer name="MobilenetV2/expanded_conv_4/project/Conv2D" type="Convolution" precision="FP32" id="32">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="16" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</output>
			<blobs>
				<biases offset="63684" size="64" />
				<weights offset="63748" size="6144" />
			</blobs>
		</layer>
		<layer name="MobilenetV2/expanded_conv_4/add" type="Eltwise" precision="FP32" id="33">
			<data operation="sum" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>16</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</output>
		</layer>
		<layer name="MobilenetV2/expanded_conv_5/expand/Conv2D" type="Convolution" precision="FP32" id="34">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="96" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</output>
			<blobs>
				<biases offset="69892" size="384" />
				<weights offset="70276" size="6144" />
			</blobs>
		</layer>
		<layer name="MobilenetV2/expanded_conv_5/expand/Relu6" type="Clamp" precision="FP32" id="35">
			<data max="6.000000" min="0.000000" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</output>
		</layer>
		<layer name="MobilenetV2/expanded_conv_5/depthwise/depthwise" type="Convolution" precision="FP32" id="36">
			<data auto_pad="same_upper" dilations="1,1" group="96" kernel="3,3" output="96" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</output>
			<blobs>
				<biases offset="76420" size="384" />
				<weights offset="76804" size="3456" />
			</blobs>
		</layer>
		<layer name="MobilenetV2/expanded_conv_5/depthwise/Relu6" type="Clamp" precision="FP32" id="37">
			<data max="6.000000" min="0.000000" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</output>
		</layer>
		<layer name="MobilenetV2/expanded_conv_5/project/Conv2D" type="Convolution" precision="FP32" id="38">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="16" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</output>
			<blobs>
				<biases offset="80260" size="64" />
				<weights offset="80324" size="6144" />
			</blobs>
		</layer>
		<layer name="MobilenetV2/expanded_conv_5/add" type="Eltwise" precision="FP32" id="39">
			<data operation="sum" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>16</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</output>
		</layer>
		<layer name="MobilenetV2/expanded_conv_6/expand/Conv2D" type="Convolution" precision="FP32" id="40">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="96" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</output>
			<blobs>
				<biases offset="86468" size="384" />
				<weights offset="86852" size="6144" />
			</blobs>
		</layer>
		<layer name="MobilenetV2/expanded_conv_6/expand/Relu6" type="Clamp" precision="FP32" id="41">
			<data max="6.000000" min="0.000000" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</output>
		</layer>
		<layer name="MobilenetV2/expanded_conv_6/depthwise/depthwise" type="Convolution" precision="FP32" id="42">
			<data auto_pad="same_upper" dilations="1,1" group="96" kernel="3,3" output="96" pads_begin="0,0" pads_end="1,1" quantization_level="FP32" strides="2,2" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
			<blobs>
				<biases offset="92996" size="384" />
				<weights offset="93380" size="3456" />
			</blobs>
		</layer>
		<layer name="MobilenetV2/expanded_conv_6/depthwise/Relu6" type="Clamp" precision="FP32" id="43">
			<data max="6.000000" min="0.000000" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer name="MobilenetV2/expanded_conv_6/project/Conv2D" type="Convolution" precision="FP32" id="44">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="24" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>24</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
			<blobs>
				<biases offset="96836" size="96" />
				<weights offset="96932" size="9216" />
			</blobs>
		</layer>
		<layer name="MobilenetV2/expanded_conv_7/expand/Conv2D" type="Convolution" precision="FP32" id="45">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="144" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>144</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
			<blobs>
				<biases offset="106148" size="576" />
				<weights offset="106724" size="13824" />
			</blobs>
		</layer>
		<layer name="MobilenetV2/expanded_conv_7/expand/Relu6" type="Clamp" precision="FP32" id="46">
			<data max="6.000000" min="0.000000" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>144</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer name="MobilenetV2/expanded_conv_7/depthwise/depthwise" type="Convolution" precision="FP32" id="47">
			<data auto_pad="same_upper" dilations="1,1" group="144" kernel="3,3" output="144" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>144</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
			<blobs>
				<biases offset="120548" size="576" />
				<weights offset="121124" size="5184" />
			</blobs>
		</layer>
		<layer name="MobilenetV2/expanded_conv_7/depthwise/Relu6" type="Clamp" precision="FP32" id="48">
			<data max="6.000000" min="0.000000" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>144</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer name="MobilenetV2/expanded_conv_7/project/Conv2D" type="Convolution" precision="FP32" id="49">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="24" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>24</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
			<blobs>
				<biases offset="126308" size="96" />
				<weights offset="126404" size="13824" />
			</blobs>
		</layer>
		<layer name="MobilenetV2/expanded_conv_7/add" type="Eltwise" precision="FP32" id="50">
			<data operation="sum" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>24</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>24</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer name="MobilenetV2/expanded_conv_8/expand/Conv2D" type="Convolution" precision="FP32" id="51">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="144" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>144</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
			<blobs>
				<biases offset="140228" size="576" />
				<weights offset="140804" size="13824" />
			</blobs>
		</layer>
		<layer name="MobilenetV2/expanded_conv_8/expand/Relu6" type="Clamp" precision="FP32" id="52">
			<data max="6.000000" min="0.000000" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>144</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer name="MobilenetV2/expanded_conv_8/depthwise/depthwise" type="Convolution" precision="FP32" id="53">
			<data auto_pad="same_upper" dilations="1,1" group="144" kernel="3,3" output="144" pads_begin="1,1" pads_end="1,1" quantization_level="FP32" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>144</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
			<blobs>
				<biases offset="154628" size="576" />
				<weights offset="155204" size="5184" />
			</blobs>
		</layer>
		<layer name="MobilenetV2/expanded_conv_8/depthwise/Relu6" type="Clamp" precision="FP32" id="54">
			<data max="6.000000" min="0.000000" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>144</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer name="MobilenetV2/expanded_conv_8/project/Conv2D" type="Convolution" precision="FP32" id="55">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="24" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>24</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
			<blobs>
				<biases offset="160388" size="96" />
				<weights offset="160484" size="13824" />
			</blobs>
		</layer>
		<layer name="MobilenetV2/expanded_conv_8/add" type="Eltwise" precision="FP32" id="56">
			<data operation="sum" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>24</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>24</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer name="MobilenetV2/expanded_conv_9/expand/Conv2D" type="Convolution" precision="FP32" id="57">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="144" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>144</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
			<blobs>
				<biases offset="174308" size="576" />
				<weights offset="174884" size="13824" />
			</blobs>
		</layer>
		<layer name="MobilenetV2/expanded_conv_9/expand/Relu6" type="Clamp" precision="FP32" id="58">
			<data max="6.000000" min="0.000000" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>144</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer name="MobilenetV2/expanded_conv_9/depthwise/depthwise" type="Convolution" precision="FP32" id="59">
			<data auto_pad="same_upper" dilations="1,1" group="144" kernel="3,3" output="144" pads_begin="1,1" pads_end="1,1" quantization_level="FP32" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>144</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
			<blobs>
				<biases offset="188708" size="576" />
				<weights offset="189284" size="5184" />
			</blobs>
		</layer>
		<layer name="MobilenetV2/expanded_conv_9/depthwise/Relu6" type="Clamp" precision="FP32" id="60">
			<data max="6.000000" min="0.000000" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>144</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer name="MobilenetV2/expanded_conv_9/project/Conv2D" type="Convolution" precision="FP32" id="61">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="24" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>24</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
			<blobs>
				<biases offset="194468" size="96" />
				<weights offset="194564" size="13824" />
			</blobs>
		</layer>
		<layer name="MobilenetV2/expanded_conv_9/add" type="Eltwise" precision="FP32" id="62">
			<data operation="sum" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>24</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>24</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer name="MobilenetV2/expanded_conv_10/expand/Conv2D" type="Convolution" precision="FP32" id="63">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="144" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>144</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
			<blobs>
				<biases offset="208388" size="576" />
				<weights offset="208964" size="13824" />
			</blobs>
		</layer>
		<layer name="MobilenetV2/expanded_conv_10/expand/Relu6" type="Clamp" precision="FP32" id="64">
			<data max="6.000000" min="0.000000" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>144</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer name="MobilenetV2/expanded_conv_10/depthwise/depthwise" type="Convolution" precision="FP32" id="65">
			<data auto_pad="same_upper" dilations="1,1" group="144" kernel="3,3" output="144" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>144</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
			<blobs>
				<biases offset="222788" size="576" />
				<weights offset="223364" size="5184" />
			</blobs>
		</layer>
		<layer name="MobilenetV2/expanded_conv_10/depthwise/Relu6" type="Clamp" precision="FP32" id="66">
			<data max="6.000000" min="0.000000" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>144</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer name="MobilenetV2/expanded_conv_10/project/Conv2D" type="Convolution" precision="FP32" id="67">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="32" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
			<blobs>
				<biases offset="228548" size="128" />
				<weights offset="228676" size="18432" />
			</blobs>
		</layer>
		<layer name="MobilenetV2/expanded_conv_11/expand/Conv2D" type="Convolution" precision="FP32" id="68">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="192" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>192</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
			<blobs>
				<biases offset="247108" size="768" />
				<weights offset="247876" size="24576" />
			</blobs>
		</layer>
		<layer name="MobilenetV2/expanded_conv_11/expand/Relu6" type="Clamp" precision="FP32" id="69">
			<data max="6.000000" min="0.000000" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>192</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer name="MobilenetV2/expanded_conv_11/depthwise/depthwise" type="Convolution" precision="FP32" id="70">
			<data auto_pad="same_upper" dilations="1,1" group="192" kernel="3,3" output="192" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>192</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
			<blobs>
				<biases offset="272452" size="768" />
				<weights offset="273220" size="6912" />
			</blobs>
		</layer>
		<layer name="MobilenetV2/expanded_conv_11/depthwise/Relu6" type="Clamp" precision="FP32" id="71">
			<data max="6.000000" min="0.000000" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>192</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer name="MobilenetV2/expanded_conv_11/project/Conv2D" type="Convolution" precision="FP32" id="72">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="32" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
			<blobs>
				<biases offset="280132" size="128" />
				<weights offset="280260" size="24576" />
			</blobs>
		</layer>
		<layer name="MobilenetV2/expanded_conv_11/add" type="Eltwise" precision="FP32" id="73">
			<data operation="sum" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer name="MobilenetV2/expanded_conv_12/expand/Conv2D" type="Convolution" precision="FP32" id="74">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="192" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>192</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
			<blobs>
				<biases offset="304836" size="768" />
				<weights offset="305604" size="24576" />
			</blobs>
		</layer>
		<layer name="MobilenetV2/expanded_conv_12/expand/Relu6" type="Clamp" precision="FP32" id="75">
			<data max="6.000000" min="0.000000" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>192</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer name="MobilenetV2/expanded_conv_12/depthwise/depthwise" type="Convolution" precision="FP32" id="76">
			<data auto_pad="same_upper" dilations="1,1" group="192" kernel="3,3" output="192" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>192</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
			<blobs>
				<biases offset="330180" size="768" />
				<weights offset="330948" size="6912" />
			</blobs>
		</layer>
		<layer name="MobilenetV2/expanded_conv_12/depthwise/Relu6" type="Clamp" precision="FP32" id="77">
			<data max="6.000000" min="0.000000" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>192</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer name="MobilenetV2/expanded_conv_12/project/Conv2D" type="Convolution" precision="FP32" id="78">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="32" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
			<blobs>
				<biases offset="337860" size="128" />
				<weights offset="337988" size="24576" />
			</blobs>
		</layer>
		<layer name="MobilenetV2/expanded_conv_12/add" type="Eltwise" precision="FP32" id="79">
			<data operation="sum" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer name="SSD/ssd_head/layer_14/output_mbox_loc/Conv2D" type="Convolution" precision="FP32" id="80">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" output="8" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>8</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
			<blobs>
				<biases offset="362564" size="32" />
				<weights offset="362596" size="9216" />
			</blobs>
		</layer>
		<layer name="SSD/ssd_head/layer_14/output_mbox_loc/Conv2D/Transpose" type="Permute" precision="FP32" id="81">
			<data order="0,2,3,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>19</dim>
					<dim>19</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer name="SSD/ssd_head/layer_14/output_mbox_conf/Conv2D" type="Convolution" precision="FP32" id="82">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" output="6" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>6</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
			<blobs>
				<biases offset="371812" size="24" />
				<weights offset="371836" size="6912" />
			</blobs>
		</layer>
		<layer name="SSD/ssd_head/layer_14/output_mbox_conf/Conv2D/Transpose" type="Permute" precision="FP32" id="83">
			<data order="0,2,3,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>6</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>19</dim>
					<dim>19</dim>
					<dim>6</dim>
				</port>
			</output>
		</layer>
		<layer name="MobilenetV2/expanded_conv_13/expand/Conv2D" type="Convolution" precision="FP32" id="84">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="192" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>192</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
			<blobs>
				<biases offset="378748" size="768" />
				<weights offset="379516" size="24576" />
			</blobs>
		</layer>
		<layer name="MobilenetV2/expanded_conv_13/expand/Relu6" type="Clamp" precision="FP32" id="85">
			<data max="6.000000" min="0.000000" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>192</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer name="MobilenetV2/expanded_conv_13/depthwise/depthwise" type="Convolution" precision="FP32" id="86">
			<data auto_pad="same_upper" dilations="1,1" group="192" kernel="3,3" output="192" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="2,2" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>192</dim>
					<dim>10</dim>
					<dim>10</dim>
				</port>
			</output>
			<blobs>
				<biases offset="404092" size="768" />
				<weights offset="404860" size="6912" />
			</blobs>
		</layer>
		<layer name="MobilenetV2/expanded_conv_13/depthwise/Relu6" type="Clamp" precision="FP32" id="87">
			<data max="6.000000" min="0.000000" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>10</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>192</dim>
					<dim>10</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer name="MobilenetV2/expanded_conv_13/project/Conv2D" type="Convolution" precision="FP32" id="88">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="56" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>10</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>56</dim>
					<dim>10</dim>
					<dim>10</dim>
				</port>
			</output>
			<blobs>
				<biases offset="411772" size="224" />
				<weights offset="411996" size="43008" />
			</blobs>
		</layer>
		<layer name="MobilenetV2/expanded_conv_14/expand/Conv2D" type="Convolution" precision="FP32" id="89">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="336" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>56</dim>
					<dim>10</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>336</dim>
					<dim>10</dim>
					<dim>10</dim>
				</port>
			</output>
			<blobs>
				<biases offset="455004" size="1344" />
				<weights offset="456348" size="75264" />
			</blobs>
		</layer>
		<layer name="MobilenetV2/expanded_conv_14/expand/Relu6" type="Clamp" precision="FP32" id="90">
			<data max="6.000000" min="0.000000" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>336</dim>
					<dim>10</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>336</dim>
					<dim>10</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer name="MobilenetV2/expanded_conv_14/depthwise/depthwise" type="Convolution" precision="FP32" id="91">
			<data auto_pad="same_upper" dilations="1,1" group="336" kernel="3,3" output="336" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>336</dim>
					<dim>10</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>336</dim>
					<dim>10</dim>
					<dim>10</dim>
				</port>
			</output>
			<blobs>
				<biases offset="531612" size="1344" />
				<weights offset="532956" size="12096" />
			</blobs>
		</layer>
		<layer name="MobilenetV2/expanded_conv_14/depthwise/Relu6" type="Clamp" precision="FP32" id="92">
			<data max="6.000000" min="0.000000" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>336</dim>
					<dim>10</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>336</dim>
					<dim>10</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer name="MobilenetV2/expanded_conv_14/project/Conv2D" type="Convolution" precision="FP32" id="93">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="56" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>336</dim>
					<dim>10</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>56</dim>
					<dim>10</dim>
					<dim>10</dim>
				</port>
			</output>
			<blobs>
				<biases offset="545052" size="224" />
				<weights offset="545276" size="75264" />
			</blobs>
		</layer>
		<layer name="MobilenetV2/expanded_conv_14/add" type="Eltwise" precision="FP32" id="94">
			<data operation="sum" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>56</dim>
					<dim>10</dim>
					<dim>10</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>56</dim>
					<dim>10</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>56</dim>
					<dim>10</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
